# 7. Реализовать генератор с помощью функции с ключевым словом yield, создающим очередное значение.
# При вызове функции должен создаваться объект-генератор. Функция вызывается следующим образом: for el in fact(n).
# Она отвечает за получение факториала числа. В цикле нужно выводить только первые n чисел, начиная с 1! и до n!.
# Подсказка: факториал числа n — произведение чисел от 1 до n. Например, факториал четырёх 4! = 1 * 2 * 3 * 4 = 24.

def fact(n):
    j = 1
    fa = []
    for i in range(1, n):
        j = j * i
        # fa.append(j)
    yield j

def fact_2(n):
    fa = [lambda j: j*i for i in range(1, n)]
    return fa

# print('\n'.join("{}: {}".format(a, b) for a, b in kwargs.items()))  # реализация печати одной строкой,

for el in fact(6):
    print(el)

for el in fact_2(6):
    print(el)

